ERP DEV.WMS/src/InformationRegisters/вмс_СохраненныеНастройки/вмс_СохраненныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_СохраненныеНастройки</name>
  <resources>
    <name>ХранилищеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_СохраненныеНастройки/ManagerModule.bsl
Функция СохранитьНастройку(ИмяОбъекта, ИмяНастройки, Настройка) Экспорт
	
	ХранилищеНастройки = Новый ХранилищеЗначения(Настройка);
	
	Запись = РегистрыСведений.вмс_СохраненныеНастройки.СоздатьМенеджерЗаписи();
	Запись.Заполнить(Неопределено);
	Запись.ИмяОбъекта = ИмяОбъекта;
	Запись.ИмяНастройки = ИмяНастройки;
	Запись.ХранилищеНастройки = ХранилищеНастройки;
	Запись.Записать();
	
КонецФункции

Функция ПолучитьНастройку(ИмяОбъекта, ИмяНастройки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_СохраненныеНастройки.ИмяОбъекта КАК ИмяОбъекта,
	|	вмс_СохраненныеНастройки.ИмяНастройки КАК ИмяНастройки,
	|	вмс_СохраненныеНастройки.ХранилищеНастройки КАК ХранилищеНастройки
	|ИЗ
	|	РегистрСведений.вмс_СохраненныеНастройки КАК вмс_СохраненныеНастройки
	|ГДЕ
	|	вмс_СохраненныеНастройки.ИмяОбъекта = &ИмяОбъекта
	|	И вмс_СохраненныеНастройки.ИмяНастройки = &ИмяНастройки";
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	Запрос.УстановитьПараметр("ИмяНастройки", ИмяНастройки);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Настройка = Выборка.ХранилищеНастройки.Получить();
		Возврат Настройка;
	КонецЕсли;

КонецФункции
